In [1]:
import pandas as pd
# import

In [6]:
train = pd.read_csv('../Data/train/train.csv')
joke = pd.read_csv('../Data/train/jokes.csv')
test = pd.read_csv('../Data/test.csv')
sample_outpur = pd.read_csv('../Data/sample_submission_.csv')

In [7]:
train

                id  user_id  joke_id  Rating
0        31030_110    31030      110   2.750
1        16144_109    16144      109   5.094
2          23098_6    23098        6  -6.438
3         14273_86    14273       86   4.406
4        18419_134    18419      134   9.375
...            ...      ...      ...     ...
1092054   9517_132     9517      132   3.156
1092055  27767_118    27767      118  -1.594
1092056   10580_81    10580       81   2.000
1092057  31007_119    31007      119   8.906
1092058    8420_98     8420       98  -3.344

[1092059 rows x 4 columns]

In [8]:
joke

     joke_id                                          joke_text
0          1  Q. What's O. J. Simpson's web address? A. Slas...
1          2  How many feminists does it take to screw in a ...
2          3  Q. Did you hear about the dyslexic devil worsh...
3          4  They asked the Japanese visitor if they have e...
4          5  Q: What did the blind person say when given so...
..       ...                                                ...
134      135  A blonde, brunette, and a red head are all lin...
135      136  America: 8:00 - Welcome to work! 12:00 - Lunch...
136      137  It was the day of the big sale. Rumors of the ...
137      138  Recently a teacher, a garbage collector, and a...
138      139  A little girl asked her father, "Daddy? Do all...

[139 rows x 2 columns]

In [9]:
test

               id  user_id  joke_id
0         6194_11     6194       11
1         19356_3    19356        3
2        23426_79    23426       79
3         40030_3    40030        3
4       19806_115    19806      115
...           ...      ...      ...
537875   14333_74    14333       74
537876   25245_16    25245       16
537877     4082_9     4082        9
537878  19638_128    19638      128
537879   40665_26    40665       26

[537880 rows x 3 columns]

In [10]:
sample_outpur

               id  Rating
0         6194_11       0
1         19356_3       0
2        23426_79       0
3         40030_3       0
4       19806_115       0
...           ...     ...
537875   14333_74       0
537876   25245_16       0
537877     4082_9       0
537878  19638_128       0
537879   40665_26       0

[537880 rows x 2 columns]